Изменения типовой конфигурации/src/InformationRegisters/Изм_СвязиПроектов/Изм_СвязиПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Изм_СвязиПроектов</name>
  <resources>
    <name>ТипСвязи</name>
    <type>
      <types>EnumRef.Изм_ТипыСвязей</types>
    </type>
  </resources>
  <resources>
    <name>Пояснение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Изм_ТехническиеПроекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.Изм_ТехническиеПроекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Изменения типовой конфигурации/src/Enums/Изм_ТипыСвязей/Изм_ТипыСвязей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Изм_ТипыСвязей</name>
  <enumValues>
    <name>Связан</name>
  </enumValues>
  <enumValues>
    <name>Содержит</name>
  </enumValues>
  <enumValues>
    <name>ВходитВСостав</name>
  </enumValues>
</mdclass:Enum>

Изменения типовой конфигурации/src/InformationRegisters/Изм_СвязиПроектов/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВыбора();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипСвязиПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УправлениеВидимостью()
	Элементы.Пояснение.Видимость = 
		Запись.ТипСвязи = ПредопределенноеЗначение("Перечисление.Изм_ТипыСвязей.Связан");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбора()
	ТипыСвязей = Перечисления.Изм_ТипыСвязей;
	Элементы.ТипСвязи.СписокВыбора.Добавить(ТипыСвязей.Связан, , ,
		 БиблиотекаКартинок.Изм_ПиктограммаПростаяСвязь);
	Элементы.ТипСвязи.СписокВыбора.Добавить(ТипыСвязей.Содержит, , , 
		БиблиотекаКартинок.Изм_ПиктограммаСостоитИз);
	Элементы.ТипСвязи.СписокВыбора.Добавить(ТипыСвязей.ВходитВСостав, , , 
		БиблиотекаКартинок.Изм_ПиктограммаВходитВСостав);
КонецПроцедуры
#КонецОбласти
